
#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`

#### Terraform `apply` 🚀``success``

<details><summary>Show `apply`</summary>

```

`Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.secrets_backend.aws_secretsmanager_secret.Dev_OReview_backend will be created
  + resource "aws_secretsmanager_secret" "Dev_OReview_backend" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "dev-oreview-backend"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Environment" = "Dev"
        }
      + tags_all                       = {
          + "Environment" = "Dev"
        }

      + replica (known after apply)
    }

  # module.secrets_backend.aws_secretsmanager_secret.Prod_OReview_backend will be created
  + resource "aws_secretsmanager_secret" "Prod_OReview_backend" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "prod-oreview-backend"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Environment" = "Prod"
        }
      + tags_all                       = {
          + "Environment" = "Prod"
        }

      + replica (known after apply)
    }

  # module.secrets_backend.aws_secretsmanager_secret_version.Dev_backend_sversion will be created
  + resource "aws_secretsmanager_secret_version" "Dev_backend_sversion" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets_backend.aws_secretsmanager_secret_version.Prod_backend_sversion will be created
  + resource "aws_secretsmanager_secret_version" "Prod_backend_sversion" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets_database.aws_secretsmanager_secret.Dev_database will be created
  + resource "aws_secretsmanager_secret" "Dev_database" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "dev-database"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Environment" = "Dev"
        }
      + tags_all                       = {
          + "Environment" = "Dev"
        }

      + replica (known after apply)
    }

  # module.secrets_database.aws_secretsmanager_secret.Prod_database will be created
  + resource "aws_secretsmanager_secret" "Prod_database" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "prod-database"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Environment" = "Prod"
        }
      + tags_all                       = {
          + "Environment" = "Prod"
        }

      + replica (known after apply)
    }

  # module.secrets_database.aws_secretsmanager_secret_version.Dev_database_sversion will be created
  + resource "aws_secretsmanager_secret_version" "Dev_database_sversion" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets_database.aws_secretsmanager_secret_version.Prod_database_sversion will be created
  + resource "aws_secretsmanager_secret_version" "Prod_database_sversion" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets_frontend.aws_secretsmanager_secret.Dev_OReview_frontend will be created
  + resource "aws_secretsmanager_secret" "Dev_OReview_frontend" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "dev-oreview-frontend"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Environment" = "Dev"
        }
      + tags_all                       = {
          + "Environment" = "Dev"
        }

      + replica (known after apply)
    }

  # module.secrets_frontend.aws_secretsmanager_secret.Prod_OReview_frontend will be created
  + resource "aws_secretsmanager_secret" "Prod_OReview_frontend" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "prod-oreview-frontend"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Environment" = "Prod"
        }
      + tags_all                       = {
          + "Environment" = "Prod"
        }

      + replica (known after apply)
    }

  # module.secrets_frontend.aws_secretsmanager_secret_version.Dev_frontend_sversion will be created
  + resource "aws_secretsmanager_secret_version" "Dev_frontend_sversion" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets_frontend.aws_secretsmanager_secret_version.Prod_frontend_sversion will be created
  + resource "aws_secretsmanager_secret_version" "Prod_frontend_sversion" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.
module.secrets_database.aws_secretsmanager_secret.Dev_database: Creating...
module.secrets_frontend.aws_secretsmanager_secret.Dev_OReview_frontend: Creating...
module.secrets_backend.aws_secretsmanager_secret.Prod_OReview_backend: Creating...
module.secrets_backend.aws_secretsmanager_secret.Dev_OReview_backend: Creating...
module.secrets_database.aws_secretsmanager_secret.Prod_database: Creating...
module.secrets_frontend.aws_secretsmanager_secret.Prod_OReview_frontend: Creating...
module.secrets_backend.aws_secretsmanager_secret.Prod_OReview_backend: Creation complete after 1s [id=arn:aws:secretsmanager:ap-northeast-2:779846792363:secret:prod-oreview-backend-ckvFtE]
module.secrets_backend.aws_secretsmanager_secret_version.Prod_backend_sversion: Creating...
module.secrets_database.aws_secretsmanager_secret.Prod_database: Creation complete after 1s [id=arn:aws:secretsmanager:ap-northeast-2:779846792363:secret:prod-database-4eUXWB]
module.secrets_database.aws_secretsmanager_secret_version.Prod_database_sversion: Creating...
module.secrets_database.aws_secretsmanager_secret.Dev_database: Creation complete after 1s [id=arn:aws:secretsmanager:ap-northeast-2:779846792363:secret:dev-database-WigyDC]
module.secrets_frontend.aws_secretsmanager_secret.Prod_OReview_frontend: Creation complete after 1s [id=arn:aws:secretsmanager:ap-northeast-2:779846792363:secret:prod-oreview-frontend-vg4fjC]
module.secrets_database.aws_secretsmanager_secret_version.Dev_database_sversion: Creating...
module.secrets_backend.aws_secretsmanager_secret.Dev_OReview_backend: Creation complete after 1s [id=arn:aws:secretsmanager:ap-northeast-2:779846792363:secret:dev-oreview-backend-Hg0tQB]
module.secrets_frontend.aws_secretsmanager_secret_version.Prod_frontend_sversion: Creating...
module.secrets_backend.aws_secretsmanager_secret_version.Dev_backend_sversion: Creating...
module.secrets_frontend.aws_secretsmanager_secret.Dev_OReview_frontend: Creation complete after 1s [id=arn:aws:secretsmanager:ap-northeast-2:779846792363:secret:dev-oreview-frontend-reNo2A]
module.secrets_frontend.aws_secretsmanager_secret_version.Dev_frontend_sversion: Creating...
module.secrets_backend.aws_secretsmanager_secret_version.Prod_backend_sversion: Creation complete after 1s [id=arn:aws:secretsmanager:ap-northeast-2:779846792363:secret:prod-oreview-backend-ckvFtE|terraform-20250303143653799800000007]
module.secrets_frontend.aws_secretsmanager_secret_version.Dev_frontend_sversion: Creation complete after 1s [id=arn:aws:secretsmanager:ap-northeast-2:779846792363:secret:dev-oreview-frontend-reNo2A|terraform-2025030314365382740000000c]
module.secrets_frontend.aws_secretsmanager_secret_version.Prod_frontend_sversion: Creation complete after 1s [id=arn:aws:secretsmanager:ap-northeast-2:779846792363:secret:prod-oreview-frontend-vg4fjC|terraform-2025030314365381510000000a]
module.secrets_database.aws_secretsmanager_secret_version.Dev_database_sversion: Creation complete after 1s [id=arn:aws:secretsmanager:ap-northeast-2:779846792363:secret:dev-database-WigyDC|terraform-20250303143653814000000009]
module.secrets_database.aws_secretsmanager_secret_version.Prod_database_sversion: Creation complete after 1s [id=arn:aws:secretsmanager:ap-northeast-2:779846792363:secret:prod-database-4eUXWB|terraform-20250303143653810400000008]
module.secrets_backend.aws_secretsmanager_secret_version.Dev_backend_sversion: Creation complete after 1s [id=arn:aws:secretsmanager:ap-northeast-2:779846792363:secret:dev-oreview-backend-Hg0tQB|terraform-2025030314365381660000000b]

Apply complete! Resources: 12 added, 0 changed, 0 destroyed.
`
```

</details>

*Pusher: @yhjs1211, Action: `workflow_dispatch`, Working Directory: ``, Workflow: `Global_secretsManager`*
